"""
Задание #1:
Дано два множества A и B
В множестве А находятся имена должников за Сентябрь
В множестве B находятся имена должников за Октябрь
Найти:
* Вывести имена людей которые должны за Сентябрь и Октябрь
* Вывести должников за Октябрь у которых нет долга за Сентябрь
"""

A = {"Petr", "Olga", "Oleg", "Andrey", "Anna", "Vlasta", "Lidia", "Svitlana"}
B = {"Inna", "Julia", "Dmitriy", "Petr", "Anton", "Ivan", "Olga", "Anna"}

print(A.intersection(B))

print(B.difference(A))
